Scanning of tfplan json file definitely reports more finding than `terraform` but it seems there is an false report
for cloudtrail logging.

Terraform scanning
```
$  terrascan scan -i terraform -t aws  .

Violation Details -
    
	Description    :	Cloud Trail Multi Region not enabled
	File           :	../../main.tf
	Line           :	1
	Severity       :	MEDIUM
	-----------------------------------------------------------------------
	

Scan Summary -

	File/Folder         :	/Users/ismail/dev/star/cloudtrail/terraform-aws-cloudtrail-0.16.0/examples/complete
	IaC Type            :	terraform
	Scanned At          :	2021-02-22 13:14:54.933818 +0000 UTC
	Policies Validated  :	159
	Violated Policies   :	1
	Low                 :	0
	Medium              :	1
	High                :	0

```
tfplan scanning

```
~/d/s/c/t/e/complete $ terraform show -json tf.out | jq  > tf.json
~/d/s/c/t/e/complete $ terrascan scan -i tfplan -t aws  -f tf.json


Violation Details -
    
	Description    :	Ensure appropriate subscribers to each SNS topic
	File           :	
	Line           :	0
	Severity       :	MEDIUM
	-----------------------------------------------------------------------
	
	Description    :	Cloud Trail Log Not Enabled
	File           :	
	Line           :	0
	Severity       :	HIGH
	-----------------------------------------------------------------------
	
	Description    :	Cloud Trail Multi Region not enabled
	File           :	
	Line           :	0
	Severity       :	MEDIUM
	-----------------------------------------------------------------------
	
	Description    :	Enabling S3 versioning will enable easy recovery from both unintended user actions, like deletes and overwrites
	File           :	
	Line           :	0
	Severity       :	HIGH
	-----------------------------------------------------------------------
	

Scan Summary -

	File/Folder         :	/Users/ismail/dev/star/cloudtrail/terraform-aws-cloudtrail-0.16.0/examples/complete/tf.json
	IaC Type            :	tfplan
	Scanned At          :	2021-02-22 13:16:40.05334 +0000 UTC
	Policies Validated  :	159
	Violated Policies   :	4
	Low                 :	0
	Medium              :	2
	
```
terraform plan output

```
# module.cloudtrail.aws_cloudtrail.default[0] will be created
  + resource "aws_cloudtrail" "default" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = false
      + is_multi_region_trail         = false
      + is_organization_trail         = false
      + name                          = "eg-test-cloudtrail-test"
      + s3_bucket_name                = (known after apply)
      + tags                          = {
          + "Name"      = "eg-test-cloudtrail-test"
          + "Namespace" = "eg"
          + "Stage"     = "test"
        }
    }

```
as you can see above `enable_logging                = true` so tfplan scanning should not report `Cloud Trail Log Not Enabled`

related lines in tf.json file


```
resources": [
 125             {
 126               "address": "module.cloudtrail.aws_cloudtrail.default[0]",
 127               "mode": "managed",
 128               "type": "aws_cloudtrail",
 129               "name": "default",
 130               "index": 0,
 131               "provider_name": "aws",
 132               "schema_version": 0,
 133               "values": {
 134                 "cloud_watch_logs_group_arn": "",
 135                 "cloud_watch_logs_role_arn": "",
 136                 "enable_log_file_validation": true,
 137                 "enable_logging": true,
 138                 "event_selector": [],
 139                 "include_global_service_events": false,
 140                 "insight_selector": [],
 141                 "is_multi_region_trail": false,
 142                 "is_organization_trail": false,
 143                 "kms_key_id": null,
 144                 "name": "eg-test-cloudtrail-test",
 145                 "s3_key_prefix": null,
 146                 "sns_topic_name": null,
 147                 "tags": {
 148                   "Name": "eg-test-cloudtrail-test",
 149                   "Namespace": "eg",
 150                   "Stage": "test"
 151                 }

```
Most probably the code does not scan child modules in tf.json
Attaching to the related tf.json file
[tfplan.txt](https://github.com/accurics/terrascan/files/6022236/tfplan.txt)
 

